[
    {
        "key": "0",
        "story": "ஸ்பைடர்-மேன் ரகசிய பணிக்காக சென்னை வந்தார். கலகலப்பான நகரம் அவரை ஆச்சரியப்படுத்தியது, ஆனால் விரைவில் ஒரு மறைக்கப்பட்ட அச்சுறுத்தலை கண்டுபிடித்தார்.",
        "choices": [
            "ரகசியமாக அச்சுறுத்தலை விசாரிக்க",
            "உள்ளூர் மக்களிடம் உதவி கேட்க"
        ]
    },
    {
        "key": "0.0",
        "story": "ஸ்பைடர்-மேன் ரகசியமாக அச்சுறுத்தலை விசாரிக்க முடிவு செய்கிறார். சென்னையின் சந்தைகள் மற்றும் கோவில்களில் தடயங்களை கண்டறிய தனது திறமைகளை பயன்படுத்துகிறார், ஆனால் எதிரிகளின் கவனத்தை ஈர்க்கிறார்.",
        "choices": [
            "நேரடியாக எதிரிகளை எதிர்கொள்ள",
            "பின்வாங்கி ஒரு திட்டம் தயார் செய்"
        ]
    },
    {
        "key": "0.1",
        "story": "ஸ்பைடர்-மேன் உள்ளூர் மக்களிடம் உதவி கேட்கிறார், இளைஞர்களின் நம்பிக்கையை பெறுகிறார். அவர்களுடன் சேர்ந்து, அச்சுறுத்தல் ஒரு தொழில்நுட்ப வில்லன் என்பதை கண்டுபிடிக்கிறார்கள்.",
        "choices": [
            "இளைஞர்களுடன் சேர்ந்து அவனை தடுக்க",
            "தனியாக வில்லனை எதிர்கொள்ள"
        ]
    },
    {
        "key": "0.0.0",
        "story": "ஸ்பைடர்-மேன் நேரடியாக எதிரிகளை எதிர்கொள்கிறார், தனது விரைவு மற்றும் பலத்தை பயன்படுத்தி. அவர்களை தோற்கடிக்கிறார், ஆனால் அச்சுறுத்தல் அவர் நினைத்ததை விட பெரியது என்பதை அறிகிறார்.",
        "choices": []
    },
    {
        "key": "0.0.1",
        "story": "ஸ்பைடர்-மேன் பின்வாங்கி ஒரு திட்டம் தயார் செய்கிறார். எதிரிகளுக்கு ஒரு பொறியை அமைக்க தனது புத்திசாலித்தனத்தை பயன்படுத்தி, சென்னையை காப்பாற்றுகிறார்.",
        "choices": []
    },
    {
        "key": "0.1.0",
        "story": "ஸ்பைடர்-மேன் மற்றும் இளைஞர்கள் ஒன்றாக வேலை செய்கிறார்கள், தொழில்நுட்பம் மற்றும் திறமைகளை இணைக்கிறார்கள். வில்லனை தோற்கடித்து சென்னையை காப்பாற்றுகிறார்கள், ஒரு சிறப்பு பிணைப்பை உருவாக்குகிறார்கள்.",
        "choices": []
    },
    {
        "key": "0.1.1",
        "story": "ஸ்பைடர்-மேன் தனியாக வில்லனை எதிர்கொள்கிறார், ஆனால் உதவி தேவை என்பதை உணர்கிறார். இளைஞர்கள் கடைசி நேரத்தில் வந்து, ஒன்றாக வெற்றி பெறுகிறார்கள்.",
        "choices": []
    }
]
